# DataFrame

In [51]:
import pandas as pd
import numpy as np

In [52]:
from numpy.random import randn
np.random.seed(101)

In [128]:
vrednosti = randn(5,4)
indeksi ='A B C D E'.split()
kolone='W X Y Z'.split()
df = pd.DataFrame(vrednosti,
    index=indeksi,
    columns=kolone
)

In [85]:
d1 = {'a':1, 'b':2}
d2 = {'a':10, 'b': 20}

df_2 = pd.DataFrame([d1, d2])
df_2.T
df_2.columns = ['c1', 'c2']
df_2.index = ['i1', 'i2']
df_2

    c1  c2
i1   1   2
i2  10  20

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
df.to_csv('tabela.csv')
df = pd.read_csv('tabela.csv', index_col=0)
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

mehanizam iza - pyarrow, arrow

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [59]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [61]:
df[['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [60]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [62]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [64]:
type(df['W'])

pandas.core.frame.DataFrame

**Creating a new column:**

In [67]:
df['new'] = df['W'] + df['Y']

In [68]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

** Removing Columns**

In [75]:
x = df.drop('W', axis=1)
x

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.614819
B -0.319318 -0.848077  0.605965 -0.196959
C  0.740122  0.528813 -0.589001 -1.489355
D -0.758872 -0.933237  0.955057 -0.744542
E  1.978757  2.605967  0.683509  2.796762

In [76]:
df = df.drop('W', axis=1)
df

          X         Y         Z       new
A  0.628133  0.907969  0.503826  3.614819
B -0.319318 -0.848077  0.605965 -0.196959
C  0.740122  0.528813 -0.589001 -1.489355
D -0.758872 -0.933237  0.955057 -0.744542
E  1.978757  2.605967  0.683509  2.796762

In [77]:
df.drop('new', axis=1, inplace=True)
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [ ]:
# Not inplace unless specified!
df

In [14]:
df.drop('new',axis=1)

In [78]:
df

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

Can also drop rows this way:

In [ ]:
df.drop('E',axis=0)

** Selecting Rows**

In [ ]:
df.loc['A']

Or select based off of position instead of label

In [ ]:
df.iloc[2]

** Selecting subset of rows and columns **

In [ ]:
df.loc['B','Y']

In [ ]:
df.loc[['A','B'],['W','Y']]

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [86]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [87]:
mask = df > 0

In [88]:
mask

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [89]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [91]:
df.where(df > 0, 111)

            W           X           Y           Z
A    0.302665    1.693723  111.000000  111.000000
B  111.000000    0.390528    0.166905    0.184502
C    0.807706    0.072960    0.638787    0.329646
D  111.000000  111.000000  111.000000    0.484752
E  111.000000    1.901755    0.238127    1.996652

In [99]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [104]:
log_izraz = (df['W'] > 0) | (df['X'] > 1)
log_izraz

A    False
B     True
C     True
D     True
E     True
dtype: bool

In [105]:
df[log_izraz]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

## More About Indexing

In [106]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [107]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [108]:
df.reset_index(drop=True)

          W         X         Y         Z
0 -0.993263  0.196800 -1.136645  0.000366
1  1.025984 -0.156598 -0.031579  0.649826
2  2.154846 -0.610259 -0.755325 -0.346419
3  0.147027 -0.479448  0.558769  1.024810
4 -0.925874  1.862864 -1.133817  0.610478

In [131]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [132]:
df.index = newind

In [111]:
df['States'] = newind
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [112]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [113]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [114]:
df = df.set_index('States')

In [127]:
df

                  A         B
Group Num
G1    1    0.386030  2.084019
      2   -0.376519  0.230336
      3    0.681209  1.035125
G2    1   -0.031160  1.939932
      2   -1.005187 -0.741790
      3    0.187125 -0.732845

# Pristupanje redovima

In [133]:
df

           W         X         Y         Z
CA -1.382920  1.482495  0.961458 -2.141212
NY  0.992573  1.192241 -1.046780  1.292765
WY -1.467514 -0.494095 -0.162535  0.485809
OR  0.392489  0.221491 -0.855196  1.541990
CO  0.666319 -0.538235 -0.568581  1.407338

In [138]:
df.loc['NY', :]

W    0.992573
X    1.192241
Y   -1.046780
Z    1.292765
Name: NY, dtype: float64

In [142]:
df.loc[['NY', 'WY', 'OR'], ['X', 'Y']]

           X         Y
NY  1.192241 -1.046780
WY -0.494095 -0.162535
OR  0.221491 -0.855196

In [143]:
df.loc[['NY', 'WY', 'OR'], ['X', 'Y']].loc[df['X'] > 0]

           X         Y
NY  1.192241 -1.046780
OR  0.221491 -0.855196

In [144]:
df

           W         X         Y         Z
CA -1.382920  1.482495  0.961458 -2.141212
NY  0.992573  1.192241 -1.046780  1.292765
WY -1.467514 -0.494095 -0.162535  0.485809
OR  0.392489  0.221491 -0.855196  1.541990
CO  0.666319 -0.538235 -0.568581  1.407338

In [146]:
df.iloc[1:3, 2:]

           Y         Z
NY -1.046780  1.292765
WY -0.162535  0.485809

## Multi-Indexing - Bonus

In [116]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [117]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [118]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [119]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [120]:
df.loc['G1'].loc[1]

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [121]:
df.index.names

FrozenList([None, None])

In [122]:
df.index.names = ['Group','Num']

In [123]:
df

                  A         B
Group Num
G1    1    0.386030  2.084019
      2   -0.376519  0.230336
      3    0.681209  1.035125
G2    1   -0.031160  1.939932
      2   -1.005187 -0.741790
      3    0.187125 -0.732845

In [124]:
df.xs('G1')

            A         B
Num
1    0.386030  2.084019
2   -0.376519  0.230336
3    0.681209  1.035125

In [125]:
df.xs(1,level='Num')

             A         B
Group
G1     0.38603  2.084019
G2    -0.03116  1.939932